DataProcessors/бит_ЗаполнениеСведенийПоКвартирам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗаполнениеСведенийПоКвартирам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/бит_ЗаполнениеСведенийПоКвартирам/Forms/ФормаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаСведений = ТекущаяДата();
	
	Если ЗначениеЗаполнено(Параметры.ДатаСведений) Тогда
		
		ДатаСведений = Параметры.ДатаСведений;
		
	КонецЕсли;
	
	Здание = Параметры.Здание;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(СтрокаКонецПериода) Тогда
		СтрокаКонецПериода = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(ДатаСведений);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.бит_Квартиры.Форма.ФормаВыбора" Тогда
		
		 ЗаполнитьТаблицуПоВыбраннымЗначениям(ВыбранноеЗначение);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КвартирыКвартираПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Квартиры.ТекущиеДанные;
	
	СтруктураСведенийОКвартире =  ЗаполнитьСвойстваПоквартире(ТекущаяСтрока.Квартира);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСведенийОКвартире);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартирыКвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Здание);
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Квартиры.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаКонецПериодаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СтрокаКонецПериода) Тогда
		СтрокаКонецПериода = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(ДатаСведений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаКонецПериодаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = ДатаСведений;
	
	бит_РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(
	Элемент, СтандартнаяОбработка, ДатаСведений, ЭтаФорма);
	СтрокаКонецПериода = бит_РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(ДатаСведений);
	ДатаСведений = КонецМесяца(ДатаСведений);
	
	ОбновитьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаКонецПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаКонецПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	НачальнаяДатаДокумента = ДатаСведений;
	
	ТекущаяДата = ?(Направление > 0, ДатаСведений, ДобавитьМесяц(ДатаСведений, -1));
	бит_РаботаСДиалогами.РегулированиеПредставленияПериодаРегистрации(
	Направление, СтандартнаяОбработка, ТекущаяДата, СтрокаКонецПериода);
	ДатаСведений = КонецМесяца(ТекущаяДата);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ЗаполнитьСведения(Команда)
	
	ЗаполнитьСведенияНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Здание);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьТаблицу();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСведенияНаСервере()
	
	Для каждого СтрокаТаблицы Из Квартиры Цикл
		
		НаборЗаписей = РегистрыСведений.бит_СведенияОКвартире.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Период.Значение      = НачалоМесяца(ДатаСведений);
		НаборЗаписей.Отбор.Период.Использование = Истина;
		
		НаборЗаписей.отбор.Квартира.Значение      = СтрокаТаблицы.Квартира;
		НаборЗаписей.Отбор.Квартира.Использование = Истина;
		НаборЗаписей.Прочитать();
		
		НаборЗаписей.Очистить();
		
		Запись = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
		
		Запись.Период                   = НачалоМесяца(ДатаСведений);
		Если ЗначениеЗаполнено(ОбщаяПлощадь) Тогда
			Запись.ОбщаяПлощадь             = ОбщаяПлощадь;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЖилаяПлощадь) Тогда
			Запись.ЖилаяПлощадь             = ЖилаяПлощадь;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОтапливаемаяПлощадь) Тогда
			Запись.ОтапливаемаяПлощадь      = ОтапливаемаяПлощадь;
		КонецЕсли;
		Если ЗначениеЗаполнено(СовокупнаяПлощадь) Тогда
			Запись.СовокупнаяПлощадь        = СовокупнаяПлощадь;
		КонецЕсли;
		Если ЗначениеЗаполнено(МОП) Тогда
			Запись.МОП                      = МОП;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТипЗапирающегоУстройства) Тогда
			Запись.ТипЗапирающегоУстройства = ТипЗапирающегоУстройства;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТипКвартиры) Тогда
			Запись.ТипКвартиры              = ТипКвартиры;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтатусКвартиры) Тогда
			Запись.СтатусКвартиры           = СтатусКвартиры;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТипПлиты) Тогда
			Запись.ТипПлиты                 = ТипПлиты;
		КонецЕсли;
				
		Попытка
			
			НаборЗаписей.Записать();
			
		Исключение

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
	ОбновитьТаблицу();
	
КонецПроцедуры

&НаСервере
Функция  ЗаполнитьСвойстваПоквартире(Квартира)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Квартира", Квартира);
	Запрос.УстановитьПараметр("Дата"    , ДатаСведений);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураСвойств = Новый Структура;
	
	Если Выборка.Следующий() Тогда
		
		СтруктураСвойств.Вставить("ОбщаяПлощадь"            , Выборка.ОбщаяПлощадь);
		СтруктураСвойств.Вставить("ЖилаяПлощадь"            , Выборка.ЖилаяПлощадь);
		СтруктураСвойств.Вставить("МОП"                     , Выборка.МОП);
		СтруктураСвойств.Вставить("ОтапливаемаяПлощадь"     , Выборка.ОтапливаемаяПлощадь);
		СтруктураСвойств.Вставить("СовокупнаяПлощадь"       , Выборка.СовокупнаяПлощадь);
		СтруктураСвойств.Вставить("ТипКвартиры"             , Выборка.ТипКвартиры);
		СтруктураСвойств.Вставить("СтатусКвартиры"          , Выборка.СтатусКвартиры);
		СтруктураСвойств.Вставить("ТипПлиты"                , Выборка.ТипПлиты);
		СтруктураСвойств.Вставить("ТипЗапирающегоУстройства", Выборка.ТипЗапирающегоУстройства);
				
	КонецЕсли; 
	
	Возврат СтруктураСвойств;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуПоВыбраннымЗначениям(МассивКвартир)
	
	ТаблицаКвартир = ПолучитьТаблицу(ДатаСведений, МассивКвартир);
	
	Для каждого Строка Из ТаблицаКвартир Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Квартира", Строка.Квартира);
		
		СтрокиПосика = Квартиры.НайтиСтроки(Отбор);
		
		Если СтрокиПосика.Количество() = 0 Тогда
			
			НоваяСтрока = Квартиры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЕсли; 
		
	КонецЦикла;  
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицу()
	
	СписокКвартир = Квартиры.Выгрузить();
	МассивКвартир = СписокКвартир.ВыгрузитьКолонку("Квартира");
	
	Квартиры.Очистить();
	
	Результат = ПолучитьТаблицу(ДатаСведений, МассивКвартир);
	
	Квартиры.Загрузить(Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицу(ДатаСведений, МассивКвартир);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"         , ДатаСведений);
	Запрос.УстановитьПараметр("СписокКвартир", МассивКвартир);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства,
	|	бит_Квартиры.Ссылка КАК Квартира
	|ИЗ
	|	Справочник.бит_Квартиры КАК бит_Квартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира В (&СписокКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_Квартиры.Ссылка = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_Квартиры.Ссылка В(&СписокКвартир)";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ()
 
#КонецОбласти
